# Задача 26: Напишите программу, которая на вход принимает два числа A и B,
#  и возводит число А в целую степень B с помощью рекурсии. 
# A = 3; B = 5 -> 243 (3⁵)
# A = 2; B = 3 -> 8

# def exp(a, b):
#     if b == 1:
#         return a
#     return a * exp(a, b-1)
# print(exp(2,3))
    
    


# Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
# Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы.
# def summa(a,b):
#     if b == 0:
#         return a
#     return summa(a + 1, b - 1) 
# print(summa(3,6))
    
